app/controllers/main_controller.rb

SELECT "users".* FROM "users" WHERE "users"."login" = ? ORDER BY "users"."id" ASC LIMIT ?  [["login", "admin"], ["LIMIT", 1]]
---
  def create
    u = User.where(login: params[:login]).first