app/controllers/scores_controller.rb

  def index
    @scores = Score.all
---
SELECT "scores".* FROM "scores"

  def create
    @score = Score.new(score_params)

    respond_to do |format|
      if @score.save
---
INSERT INTO "scores" ("subject", "point", "grade", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["subject", "m"], ["point", 60], ["grade", "D"], ["student_id", 1], ["created_at", "2022-09-22 07:51:02.172749"], ["updated_at", "2022-09-22 07:51:02.172749"]]

    def set_score
      @score = Score.find(params[:id])
---
SELECT "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]